blog/nodejs-express.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>subham kumar</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">subham kumar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5985ddf">Express</a>
<ul>
<li><a href="#org0445773">Express Routing &amp; Middleware</a></li>
<li><a href="#org6375269">middleware,</a></li>
<li><a href="#orgef203da">Route Handlers</a></li>
<li><a href="#org175b5da">Query Parameters</a></li>
<li><a href="#orga52ba8c">Express.Router</a></li>
<li><a href="#orgbee7f02">Route parameters</a></li>
<li><a href="#org338365f">Response Object</a></li>
<li><a href="#org00903ff">storing them in a jsonbin</a></li>
<li><a href="#orgdeeb8c0">MIDDLEWARE</a></li>
<li><a href="#org69f7562">route level middleware</a></li>
<li><a href="#org231216a">built in middleware</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5985ddf" class="outline-2">
<h2 id="org5985ddf">Express</h2>
<div class="outline-text-2" id="text-org5985ddf">
<div class="org-src-container">
<pre class="src src-js">
console.log(<span style="color: #98be65;">"hello wordld"</span>);

</pre>
</div>
</div>

<div id="outline-container-org0445773" class="outline-3">
<h3 id="org0445773">Express Routing &amp; Middleware</h3>
<div class="outline-text-3" id="text-org0445773">
<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">import</span> express from <span style="color: #98be65;">'express'</span>;
<span style="color: #51afef;">import</span> {JsBin} from <span style="color: #98be65;">'./db.js'</span>;


<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">dbReadKey</span> = process.env.JSBIN_ACCESS_KEY
                || <span style="color: #98be65;">"$2b$10$ZT0hO3hBks9DS34Q/wljm.iRbwDGm91hSrvhP9WqHGE6dU13bZt.u"</span>;
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">db</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">JsBin</span>(dbReadKey);

<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">app</span> = express();

<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">todos</span> = [
    { id: 1, isComplete: <span style="color: #a9a1e1;">true</span>, name : <span style="color: #98be65;">'do sometgin'</span>},
    { id: 2, isComplete: <span style="color: #a9a1e1;">true</span>, name : <span style="color: #98be65;">'do sometgin'</span>},
    { id: 3, isComplete: <span style="color: #a9a1e1;">false</span>, name : <span style="color: #98be65;">'do sometgin'</span>},
    { id: 4, isComplete: <span style="color: #a9a1e1;">false</span>, name : <span style="color: #98be65;">'do sometgin'</span>},
    { id: 5, isComplete: <span style="color: #a9a1e1;">false</span>, name : <span style="color: #98be65;">'do sometgin'</span>},
]

<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">constants</span> = {
        DB_READ_KEY: process.env.JSBIN_ACCESS_KEY
};

</pre>
</div>
</div>
</div>

<div id="outline-container-org6375269" class="outline-3">
<h3 id="org6375269">middleware,</h3>
<div class="outline-text-3" id="text-org6375269">
<p>
     middleware are functions that called before the routing,
     has access to req, res and next.
     next() must be called or else the route handlers won't get called and client will timeout
     app.use() need to be called to enable the middleware
[x] next,
 calls the next middleware
</p>

<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">logger</span> = (req, res, next) =&gt; {
        req.id = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Date</span>();
    console.log(<span style="color: #98be65;">'logger | requestId'</span>, req.id);
        next();
}

app.use(logger);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef203da" class="outline-3">
<h3 id="orgef203da">Route Handlers</h3>
<div class="outline-text-3" id="text-orgef203da">
<p>
we can have
app(routeString, handler1(req, res))
app(routeString, middleware(req, res, next), handler2(req, res))
app(routeString, middleware(req, res, next), , , handler2(req, res))
app(routeString, [middleware(req, res, next), handler2(req, res)])
</p>


<div class="org-src-container">
<pre class="src src-js">
app.get(<span style="color: #98be65;">'/'</span>, rootInputHandler, rootController, rootOutputHandler);
app.get(<span style="color: #98be65;">'/array'</span>, [rootInputHandler, rootController, rootOutputHandler]);
app.get(<span style="color: #98be65;">'/partialarray'</span>, rootInputHandler, [rootController, rootOutputHandler]);

</pre>
</div>
</div>
</div>

<div id="outline-container-org175b5da" class="outline-3">
<h3 id="org175b5da">Query Parameters</h3>
<div class="outline-text-3" id="text-org175b5da">
<p>
req.query gives us access to query parameters
</p>

<div class="org-src-container">
<pre class="src src-js">
app.get(<span style="color: #98be65;">'/ml/random/'</span>, rootInputHandler, (req, res) =&gt; {
        <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">min</span> = parseInt(req.query.min);
        <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">max</span> = parseInt(req.query.min);
        console.log(max)
        res.send({ num: (min + max) / 2})
});

</pre>
</div>
</div>
</div>

<div id="outline-container-orga52ba8c" class="outline-3">
<h3 id="orga52ba8c">Express.Router</h3>
<div class="outline-text-3" id="text-orga52ba8c">
<p>
this gives a mini-app, modular way to organize resources.
</p>
<ul class="org-ul">
<li>can also have middleware which deals with only its routes</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">pdfRouter</span> = express.Router();

pdfRouter.use((req, res, next) =&gt; {
        console.log(<span style="color: #98be65;">"pdfRouter | middleware"</span>);
        next();
});

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbee7f02" class="outline-3">
<h3 id="orgbee7f02">Route parameters</h3>
<div class="outline-text-3" id="text-orgbee7f02">
<p>
 [x] path,
'<i>:name</i> can be accesed via req.params will have obj {name: name in url}
to download it using curl
curl -o {your<sub>file</sub><sub>name</sub>} url
</p>


<div class="org-src-container">
<pre class="src src-js">
pdfRouter.get(<span style="color: #98be65;">'/:name'</span>, rootInputHandler, (req, res) =&gt; {
        res.download(<span style="color: #98be65;">`pdf/${req.params.name}`</span>)
});

</pre>
</div>
</div>
</div>

<div id="outline-container-org338365f" class="outline-3">
<h3 id="org338365f">Response Object</h3>
<div class="outline-text-3" id="text-org338365f">
<ul class="org-ul">
<li>json</li>
<li>send</li>
<li>sendStatus</li>
<li>download</li>
<li>redirect</li>
</ul>


<div class="org-src-container">
<pre class="src src-js">
app.get(<span style="color: #98be65;">'/v1/:name'</span>, rootInputHandler, (req, res) =&gt; {
        res.redirect(<span style="color: #98be65;">`../../pdf/${req.params.name}`</span>)
});

app.use(<span style="color: #98be65;">'/pdf'</span>, pdfRouter);

app.get(<span style="color: #98be65;">'/gf/'</span>, rootInputHandler, (req, res) =&gt; {
        res.sendStatus(404)
});

</pre>
</div>
</div>
</div>

<div id="outline-container-org00903ff" class="outline-3">
<h3 id="org00903ff">storing them in a jsonbin</h3>
<div class="outline-text-3" id="text-org00903ff">
<div class="org-src-container">
<pre class="src src-js">
app.get(<span style="color: #98be65;">'/waifu/'</span>, rootInputHandler, <span style="color: #51afef;">async</span> (req, res) =&gt; {
        <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">binName</span> = <span style="color: #98be65;">'63353f49e13e6063dcb9c0a8'</span>;
        <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">waifus</span> = <span style="color: #51afef;">await</span> db.readBin(binName);
        res.send(waifus);
});

</pre>
</div>
</div>
</div>

<div id="outline-container-orgdeeb8c0" class="outline-3">
<h3 id="orgdeeb8c0">MIDDLEWARE</h3>
</div>
<div id="outline-container-org69f7562" class="outline-3">
<h3 id="org69f7562">route level middleware</h3>
<div class="outline-text-3" id="text-org69f7562">
<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">isValid</span> = () =&gt; parseInt(Math.random() * 10) % 2 == 0;

<span style="color: #51afef;">function</span> <span style="color: #c678dd;">rootInputHandler</span>(<span style="color: #dcaeea;">req</span>, <span style="color: #dcaeea;">res</span>, <span style="color: #dcaeea;">next</span>) {
        console.log(<span style="color: #98be65;">"routeInputHandler middleware"</span>, req.id);

        <span style="color: #51afef;">if</span> (isValid()) {
                next()
        }
        <span style="color: #51afef;">else</span> {
                console.log(<span style="color: #98be65;">'routeInputHandler | invalid input'</span>);
                res.send(<span style="color: #98be65;">'invalid input'</span>);
        }
}

<span style="color: #51afef;">function</span> <span style="color: #c678dd;">rootController</span> (<span style="color: #dcaeea;">req</span>, <span style="color: #dcaeea;">res</span>, <span style="color: #dcaeea;">next</span>) {
        console.log(<span style="color: #98be65;">"route controller "</span>, req.id);
    req.data = {<span style="color: #98be65;">'message'</span>: <span style="color: #98be65;">'hello world'</span>};
        next();
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org231216a" class="outline-3">
<h3 id="org231216a">built in middleware</h3>
<div class="outline-text-3" id="text-org231216a">
<ul class="org-ul">
<li>- express static serve as a FTP server</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">staticOptions</span> = {
                <span style="color: #98be65;">"index"</span>: <span style="color: #a9a1e1;">true</span>,
                <span style="color: #98be65;">"extensions"</span>: [<span style="color: #98be65;">"html"</span>, <span style="color: #98be65;">"pdf"</span>]
};
app.use(<span style="color: #98be65;">"/web/"</span>, express.<span style="color: #51afef;">static</span>(<span style="color: #98be65;">"public"</span>, staticOptions));
app.use(<span style="color: #98be65;">"/doc/"</span>, express.<span style="color: #51afef;">static</span>(<span style="color: #98be65;">"pdf"</span>, staticOptions));

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">express.json middleware to parse json payload</span>

app.use(express.json({limit:<span style="color: #98be65;">"1mb"</span>}));

</pre>
</div>



<p>
/*
</p>
<ul class="org-ul">
<li>Response Object</li>
<li><code>=============</code></li>
<li></li>

<li>*/</li>
</ul>


<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">port</span> = 8080;

app.listen(port, () =&gt; {
        console.log(<span style="color: #98be65;">'server listening on port'</span>, port);
});

</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>